Tekla Open API Reference for Tekla Structures 2025
Phase.Delete Method
 Deletes a phase. The current phase cannot be deleted.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Delete()
Public Function Delete As Boolean
Return Value
Type: Boolean
True on success, false if failed (the attached objects probably caused the failure).
See Also
Reference
Phase Class
Tekla.Structures.Model Namespace